/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   color.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: vdelsie <vdelsie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/12/18 16:28:59 by vdelsie           #+#    #+#             */
/*   Updated: 2019/12/19 16:50:02 by vdelsie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdlib.h>
#include <math.h>
#include "fractol.h"

void    setup_color(t_envars *env)
{

}

void    toggle_palette(t_envars *env)
{
    
}

void    color_surprise(t_envars *env)
{
    
}

void    psychedelic_surprise(t_envars *env)
{

}


/*
** choose_col ()
** Давайте использовать математическую магию, чтобы создать красивые цвета!
** Используя синусоидальную волну и сдвигая частоту и фазу на r, g, b
** цветовые компоненты мы можем генерировать регулярные повторяющиеся цветовые градиенты!
**
** Центр нашей цветовой гаммы 127 (потому что 255 макс.)
** Таким образом, ширина нашего цветового диапазона составляет 128 (если мы хотим эффекты радуги)
** Сильно вдохновило решение: https://krazydad.com//tutorials/makecolors.php
*/

int     choose_col(t_envars *env, float iter)
{
    
}