/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   fractal_funcs.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: vdelsie <vdelsie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/12/18 19:36:12 by vdelsie           #+#    #+#             */
/*   Updated: 2019/12/19 16:53:26 by vdelsie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "fractol.h"

/*
** Мандельброт ()
** Базовый набор Мандельброта, где 'c' определяется на основе местоположения пикселя
** в ограниченной области (см .: fractal_setup _ ?. c функции для получения границ)
*/

void    mandelbrod(t_envars *env, int pix_ind)
{
    
}

/*
** Джулия()
** Набор Джулии * очень * похож на набор Мандельброта
** Единственное отличие состоит в том, что значение c определяется положением
** курсор мыши. Это буквально единственная разница ...
*/

void    julia(t_envars *env, int pix_ind)
{
    
}