/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   fractol_setup_0.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: vdelsie <vdelsie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/12/19 16:42:59 by vdelsie           #+#    #+#             */
/*   Updated: 2019/12/19 16:58:09 by vdelsie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
** setup_fract ()
** Инициализирует коэффициент масштабирования, координаты центра 'x, y' нашего фрактала как
** а также ширина наших размеров х и у.
*/

void    setup_julia(void *environ)
{
    
}

void	setup_mandelbrot(void *environ)
{
    
}