/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   loop_hooks.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: vdelsie <vdelsie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/12/19 18:45:47 by vdelsie           #+#    #+#             */
/*   Updated: 2019/12/19 18:46:38 by vdelsie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <math.h>
#include "fractol.h"


/*
** loop_hook ()
** Эта петля петли необходима для психоделического режима, который меняет фазу
** волн rgb sin, так что цвета будут волнистыми.
**
** Мы хотим, чтобы относительное фазовое соотношение между r, g и b оставалось неизменным
** поэтому мы добавляем одинаковое количество к каждой фазе. Если сдвиг фазы превышает 2 * PI
** Затем нам нужно взять модуль поплавка, чтобы он вернулся в диапазон наших
** 2 * ПИ-лимит.
*/


int		loop_hook(t_envars *env)
{
	t_color	*c;

	if (env->psychedelic == 1)
	{
		c = &env->c;
		c->r_phase = (c->r_phase > 2 * M_PI) ?
		fmod(c->r_phase, 2 * M_PI) : c->r_phase + 0.05;
		c->g_phase = (c->g_phase > 2 * M_PI) ?
		fmod(c->g_phase, 2 * M_PI) : c->g_phase + 0.05;
		c->b_phase = (c->b_phase > 2 * M_PI) ?
		fmod(c->b_phase, 2 * M_PI) : c->b_phase + 0.05;
		render(env);
	}
	return (0);
}
