/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   render.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: vdelsie <vdelsie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/12/19 19:30:27 by vdelsie           #+#    #+#             */
/*   Updated: 2019/12/19 19:35:17 by vdelsie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <mlx.h>
#include "fractol.h"
#define IS_LEFT(x) ((x)==0||(x)==2)
#define IS_TOP(x) ((x)==0||(x)==1)


/*
** render_quads ()
** Эта функция будет рисовать все пиксели фрактала для 1 квадранта
**	окно. Это позволяет многопоточность, так что с 4 потоками каждый может позаботиться о 1
** квадрантe.
*/

void    